import { Services } from "@/types/generalTypes";
import {
  Target,
  DollarSign,
  Users,
  Compass,
  BarChart2,
  Clock,
  Settings,
  CreditCard,
} from "lucide-react";

export const services: Services[] = [
  {
    id: 1,
    title: "نداشتن برنامه برای رشد",
    desc: "اگر استراتژی مشخصی برای رشد ندارید، پرشین سایت نقشه راه جامعی برای شما طراحی خواهد کرد.",
    icon: Target,
  },
  {
    id: 2,
    title: "دغدغه هدر رفتن بودجه",
    desc: "اگر نگران عدم کسب نتیجه هستید، پرشین سایت با برنامه‌ریزی دقیق به شما اطمینان می‌دهد که از بودجه خود به بهترین نحو استفاده خواهید کرد.",
    icon: DollarSign,
  },
  {
    id: 3,
    title: "عدم تخصص تیم در تبلیغات",
    desc: "اگر تیم شما تجربه کافی در زمینه تبلیغات ندارد، ما تمامی فرآیندها را به صورت حرفه‌ای و با کیفیت بالا انجام خواهیم داد.",
    icon: Users,
  },
  {
    id: 4,
    title: "نبود استراتژی مشخص",
    desc: "نگران هماهنگی با اهداف کسب‌وکار خود نباشید؛ پرشین سایت برنامه‌ای متناسب با نیازهای شما طراحی خواهد کرد.",
    icon: Compass,
  },
  {
    id: 5,
    title: "ناآگاهی از تأثیر تبلیغات",
    desc: "بسیاری از افراد نمی‌دانند که کمپین‌های تبلیغاتی چگونه می‌توانند منجر به افزایش فروش شوند؛ ما این تأثیرات را به وضوح برای شما نمایش خواهیم داد.",
    icon: BarChart2,
  },
  {
    id: 6,
    title: "تصور زمان‌بر بودن نتایج",
    desc: "برخی از افراد نگران این هستند که نتایج تبلیغات دیر به دست آید، در حالی که پرشین سایت با سرعت بالا، شما را در دستیابی به نتایج مطلوب یاری می‌کند.",
    icon: Clock,
  },
  {
    id: 7,
    title: "ترس از پیچیدگی مدیریت",
    desc: "مدیران ممکن است نگران دشواری مدیریت کمپین‌ها باشند، اما ما تمامی فرآیندها را به ساده‌ترین شکل ممکن ارائه می‌دهیم.",
    icon: Settings,
  },
  {
    id: 8,
    title: "نگرانی از هزینه‌های تبلیغات",
    desc: "برخی افراد ممکن است تصور کنند که تبلیغات هزینه‌بر است؛ اما پرشین سایت با ارائه سود بالا، این هزینه‌ها را جبران می‌کند.",
    icon: CreditCard,
  },
];

export const faqData = [
  {
    question: "مراحل طراحی وب سایت چیست؟",
    answer:
      "سوالات متداولی که ممکن است نیاز شما نیز باشند در اینجا پاسخ داده شده اند.",
  },
  {
    question: "چقدر زمان برای طراحی وب سایت لازم است؟",
    answer:
      "زمان طراحی بسته به پیچیدگی وب سایت متفاوت است، معمولاً بین 2 تا 6 هفته طول می‌کشد.",
  },
  {
    question: "آیا وب سایت ریسپانسیو خواهد بود؟",
    answer:
      "بله، تمامی وب سایت‌ها به صورت واکنش‌گرا و مناسب برای موبایل و دسکتاپ طراحی می‌شوند.",
  },
  {
    question: "آیا پشتیبانی پس از طراحی ارائه می‌شود؟",
    answer:
      "بله، ما پشتیبانی فنی و آموزشی پس از تحویل وب سایت ارائه می‌کنیم.",
  },
  {
    question: "هزینه طراحی وب سایت چگونه محاسبه می‌شود؟",
    answer:
      "هزینه بسته به نوع و امکانات وب سایت متفاوت است، برای اطلاعات دقیق با ما تماس بگیرید.",
  },
];